Masmiseim36/nxpSDK/boards/mimxrt685audevk/demo_apps/dmic_i2s_hwvad/dmic_i2s_hwvad.c
/*
 * Copyright 2021 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
#include <stdlib.h>
#include <string.h>
#include "app.h"
#include "board.h"
#include "fsl_codec_common.h"
#include "fsl_debug_console.h"
#include "fsl_device_registers.h"
#include "fsl_dmic.h"
#include "fsl_dmic_dma.h"
#include "fsl_i2c.h"
#include "fsl_i2s.h"
#include "fsl_i2s_dma.h"
#include "fsl_inputmux.h"
#include "fsl_power.h"
#include "FreeRTOS.h"
#include "semphr.h"
#include "task.h"
#include "fsl_sx1502.h"
/*******************************************************************************
 * Definitions
 ******************************************************************************/
#define FIFO_DEPTH           (15U)
#define PLAYBACK_BUFFER_SIZE (1024)
#define PLAYBACK_BUFFER_NUM  (2U)
#define RECORD_BUFFER_SIZE   (64)
#define RECORD_BUFFER_NUM    (DEMO_DMIC_NUMS * PLAYBACK_BUFFER_NUM)
#if DEMO_ENABLE_DMIC_0
#define DEMO_DMIC_MAX_ID 0
#endif
#if DEMO_ENABLE_DMIC_1
#undef DEMO_DMIC_MAX_ID
#define DEMO_DMIC_MAX_ID 1
#endif
#if DEMO_ENABLE_DMIC_2
#undef DEMO_DMIC_MAX_ID
#define DEMO_DMIC_MAX_ID 2
#endif
#if DEMO_ENABLE_DMIC_3
#undef DEMO_DMIC_MAX_ID
#define DEMO_DMIC_MAX_ID 3
#endif
#if DEMO_ENABLE_DMIC_4
#undef DEMO_DMIC_MAX_ID
#define DEMO_DMIC_MAX_ID 4
#endif
#if DEMO_ENABLE_DMIC_5
#undef DEMO_DMIC_MAX_ID
#define DEMO_DMIC_MAX_ID 5
#endif
#if DEMO_ENABLE_DMIC_6
#undef DEMO_DMIC_MAX_ID
#define DEMO_DMIC_MAX_ID 6
#endif
#if DEMO_ENABLE_DMIC_7
#undef DEMO_DMIC_MAX_ID
#define DEMO_DMIC_MAX_ID 7
#endif
#ifndef DEMO_DMIC_MAX_ID
#error "Please enable at least one DMIC"
#endif
/*! @brief Task stack size. */
#define MENU_TASK_STACK_SIZE (1024U)
/*! @brief Task stack priority. */
#define MENU_TASK_PRIORITY (configMAX_PRIORITIES - 1U)

/*! @brief Task stack size. */
#define SX1502_TASK_STACK_SIZE (1024U)
/*! @brief Task stack priority. */
#define SX1502_TASK_PRIORITY (configMAX_PRIORITIES - 2U)

/*! @brief Task stack size. */
#define RECORD_PLAYBACK_TASK_STACK_SIZE (1024U)
/*! @brief Task stack priority. */
#define RECORD_PLAYBACK_TASK_PRIORITY (configMAX_PRIORITIES - 2U)
/*******************************************************************************
 * Prototypes
 ******************************************************************************/
static void i2s_Callback(I2S_Type *base, i2s_dma_handle_t *handle, status_t completionStatus, void *userData);
static void memcpy_channel_callback(struct _dma_handle *handle, void *userData, bool transferDone, uint32_t intmode);
static void DEMO_DMAChannelConfigurations(void);
static void DEMO_PreparingRecordDMIC(void);
static void DEMO_DMICChannelConfigurations(void);
#ifdef DMIC_FLASH_TARGET
static void ReceiverTransferConfig(dmic_transfer_t *startAddress,
                                   void *dataAddr,
                                   uint32_t xferNum,
                                   uint32_t dataWidth,
                                   uint32_t dataSizePerTransfer,
                                   uint32_t interleaveSize,
                                   uint32_t startChannel);
#else
static void ReceiverTransferConfig(dmic_transfer_t *startAddress,
                                   void *dataAddr,
                                   uint32_t xferNum,
                                   uint32_t dataWidth,
                                   uint32_t dataSizePerTransfer,
                                   uint32_t interleaveSize);
#endif
extern void BORAD_CodecReset(bool state);
static void DEMO_DMAMemcpyChannelConfigurations(void);
static void dmic_Callback(DMIC_Type *base, dmic_dma_handle_t *handle, status_t status, void *userData);
static void DEMO_I2SConfigurations(void);
static void DEMO_EnterSleepMode(void);
static void DEMO_AbortRecordPlayback(void);
static void MenuTask(void *pvParameters);
static void SX1502Task(void *pvParameters);
static void RecordPlayBackTask(void *pvParameters);
/*******************************************************************************
 * Variables
 ******************************************************************************/
static i2s_config_t tx_config;
static uint32_t volatile s_RecordEmptyBlock = PLAYBACK_BUFFER_NUM;
/* DMIC dma handle for 8 channel */
static dmic_dma_handle_t s_dmicDmaHandle[DEMO_DMIC_NUMS];
/* dma handle for 8 channel */
static dma_handle_t s_dmaHandle[DEMO_DMIC_NUMS];
/* i2s dma handle */
static dma_handle_t s_i2sTxDmaHandle;
static dma_handle_t s_memcpyDmaHandle0;
static dma_handle_t s_memcpyDmaHandle1;
static i2s_dma_handle_t s_i2sTxHandle;
/* ping pong descriptor */
SDK_ALIGN(dma_descriptor_t s_dmaDescriptorPingpong[RECORD_BUFFER_NUM], 16);
SDK_ALIGN(dma_descriptor_t s_memcpyDescriptor[PLAYBACK_BUFFER_NUM * 2U], 16);
/* dmic transfer configurations */
static dmic_transfer_t s_receiveXfer0[RECORD_BUFFER_NUM / 2];
static dmic_transfer_t s_receiveXfer1[RECORD_BUFFER_NUM / 2];
/* dmic channel configurations */
static dmic_channel_config_t s_dmicChannelConfig = {
    .divhfclk            = kDMIC_PdmDiv1,
    .osr                 = 32U,
    .gainshft            = 3U,
    .preac2coef          = kDMIC_CompValueZero,
    .preac4coef          = kDMIC_CompValueZero,
    .dc_cut_level        = kDMIC_DcCut155,
    .post_dc_gain_reduce = 1U,
    .saturate16bit       = 1U,
    .sample_rate         = kDMIC_PhyFullSpeed,
};

/*!@breif data buffer */
SDK_ALIGN(static uint8_t s_processedAudio[RECORD_BUFFER_SIZE * RECORD_BUFFER_NUM * 4U], 4U);
SDK_ALIGN(static uint8_t s_recordBuffer0[RECORD_BUFFER_SIZE * RECORD_BUFFER_NUM / 2], 4U);
SDK_ALIGN(static uint8_t s_recordBuffer1[RECORD_BUFFER_SIZE * RECORD_BUFFER_NUM / 2], 4U);
static SemaphoreHandle_t s_menuTasksSemaphore      = NULL;
static SemaphoreHandle_t s_recordPlaybackSemaphore = NULL;
static SemaphoreHandle_t s_sx1502TasksSemaphore    = NULL;

static volatile bool s_m2mBufferReady         = false;
static volatile bool s_buffer1Ready           = false;
static volatile bool s_i2sTransferFinish      = false;
static volatile uint8_t s_dmicBufferIndex     = 0U;
static volatile uint8_t s_m2mBufferIndex      = 0U;
static volatile bool s_isDMICTriggerred       = false;
static dma_channel_trigger_t s_channelTrigger = {
    .type  = kDMA_FallingEdgeTrigger,
    .burst = kDMA_SingleTransfer,
    .wrap  = kDMA_NoWrap,
};
extern sx1502_handle_t sx1502Handle;
/*******************************************************************************
 * Code
 ******************************************************************************/

/*!
 * @brief Main function
 */

int main(void)
{
    /* Board pin, clock, debug console init */
    BOARD_InitHardware();
    BOARD_InitCodec();
    BOARD_InitSX1502();
    DEMO_DMAChannelConfigurations();
    DEMO_DMICChannelConfigurations();
    DEMO_I2SConfigurations();

