Masmiseim36/nxpSDK/boards/mimxrt685audevk/demo_apps/dmic_i2s_hwvad/dmic_i2s_hwvad.c
    PRINTF("\r\ndmic i2s hwvad example.\r\n");

    if (pdPASS != xTaskCreate(MenuTask, "MenuTask", MENU_TASK_STACK_SIZE, NULL, MENU_TASK_PRIORITY, NULL))
    {
        return -1;
    }

    if (pdPASS != xTaskCreate(SX1502Task, "SX1502Task", SX1502_TASK_STACK_SIZE, NULL, SX1502_TASK_PRIORITY, NULL))
    {
        return -1;
    }

    if (pdPASS != xTaskCreate(RecordPlayBackTask, "RecordPlayBackTask", RECORD_PLAYBACK_TASK_STACK_SIZE, NULL,
                              RECORD_PLAYBACK_TASK_PRIORITY, NULL))
    {
        return -1;
    }

    /* Start the tasks and timer running. */
    vTaskStartScheduler();

    /* Scheduler should never reach this point. */
    while (true)
    {
    }
}

static void DMIC0_HWVAD_Callback(void)
{
    volatile int i;

    /* trigger LED  */
    xSemaphoreGiveFromISR(s_sx1502TasksSemaphore, NULL);
    DisableIRQ(HWVAD0_IRQn);

    /* reset hwvad internal interrupt */
    DMIC_CtrlClrIntrHwvad(DMIC0, true);
    /* wait for HWVAD to settle */
    for (i = 0; i <= 500U; i++)
    {
    }
    /*HWVAD Normal operation */
    DMIC_CtrlClrIntrHwvad(DMIC0, false);
}

static void MenuTask(void *pvParameters)
{
    char input;
    uint32_t startTicks       = 0;
    s_menuTasksSemaphore      = xSemaphoreCreateBinary();
    s_recordPlaybackSemaphore = xSemaphoreCreateBinary();
    s_sx1502TasksSemaphore    = xSemaphoreCreateBinary();

    while (1)
    {
        PRINTF("\r\n    1: Record and playback\r\n");
        PRINTF("\r\n    2: Enter sleep mode\r\n");

        startTicks = xTaskGetTickCount();
        do
        {
            if (DbgConsole_TryGetchar(&input) == kStatus_Success)
            {
                if (input == '1')
                {
                    xSemaphoreGive(s_recordPlaybackSemaphore);
                    break;
                }
                else if (input == '2')
                {
                    DEMO_EnterSleepMode();
                    break;
                }
                else
                {
                    PRINTF("\r\nInvalid input, please retry.\r\n");
                    continue;
                }
            }
            else
            {
                /* no input, sysem going to sleep automatically */
                if (xTaskGetTickCount() - startTicks > DEMO_AUTO_ENTER_SLEEP_MODE_TIME_MS)
                {
                    DEMO_EnterSleepMode();
                    break;
                }
            }
        } while (1);

        xSemaphoreTake(s_menuTasksSemaphore, portMAX_DELAY);
    }
}

static void RecordPlayBackTask(void *pvParameters)
{
    uint32_t startTicks = 0U;
    i2s_transfer_t i2sTxTransfer;
    s_recordPlaybackSemaphore = xSemaphoreCreateBinary();

    xSemaphoreGive(s_recordPlaybackSemaphore);

    while (1)
    {
        xSemaphoreTake(s_recordPlaybackSemaphore, portMAX_DELAY);

        s_RecordEmptyBlock = PLAYBACK_BUFFER_NUM;
        s_isDMICTriggerred = false;
        s_m2mBufferReady   = false;
        s_dmicBufferIndex  = 0U;
        s_m2mBufferIndex   = 0U;
        DEMO_PreparingRecordDMIC();
        DEMO_DMAMemcpyChannelConfigurations();

        startTicks = xTaskGetTickCount();

        while (1)
        {
            if (s_RecordEmptyBlock < PLAYBACK_BUFFER_NUM)
            {
                i2sTxTransfer.data     = s_processedAudio + (s_m2mBufferIndex == 0U ? 1U : 0U) * PLAYBACK_BUFFER_SIZE;
                i2sTxTransfer.dataSize = PLAYBACK_BUFFER_SIZE;
                I2S_TxTransferSendDMA(DEMO_I2S_TX, &s_i2sTxHandle, i2sTxTransfer);
            }

            if ((s_isDMICTriggerred) && (s_m2mBufferReady))
            {
                s_isDMICTriggerred = false;
                s_m2mBufferReady   = false;
                DMA_StartTransfer(&s_memcpyDmaHandle0);
            }

            /* only playack 10000 ticks */
            if (xTaskGetTickCount() - startTicks > DEMO_RECORD_PLAYBACK_TIME_MS)
            {
                DEMO_AbortRecordPlayback();
                break;
            }
        }

        /* Acitve menu task */
        xSemaphoreGive(s_menuTasksSemaphore);
    }
}

static void SX1502Task(void *pvParameters)
{
    while (1)
    {
        xSemaphoreTake(s_sx1502TasksSemaphore, portMAX_DELAY);

        SX1502_IO_OutputControl(&sx1502Handle, kSX1502_IO_All, 0x00U);

        vTaskDelay(1000U);

        SX1502_IO_OutputControl(&sx1502Handle, kSX1502_IO_All, 0xFFU);

        /* Acitve menu task */
        xSemaphoreGive(s_menuTasksSemaphore);
    }
}

static void DEMO_EnterSleepMode(void)
{
    uint32_t i = 0;

    PRINTF("\r\nGoing to sleep.\r\n");

    /* reset hwvad internal interrupt */
    DMIC_CtrlClrIntrHwvad(DMIC0, true);
    /* wait for HWVAD to settle */
    for (i = 0; i <= 500U; i++)
    {
    }
    /*HWVAD Normal operation */
    DMIC_CtrlClrIntrHwvad(DMIC0, false);
    NVIC_ClearPendingIRQ(HWVAD0_IRQn);
    /* enable voice detect event */
    EnableIRQWithPriority(HWVAD0_IRQn, 1 << (__NVIC_PRIO_BITS - 1));

    __WFI();
}

static void DEMO_I2SConfigurations(void)
{
    /* i2s configurations */
    /*
     * masterSlave = kI2S_MasterSlaveNormalMaster;
     * mode = kI2S_ModeI2sClassic;
     * rightLow = false;
     * leftJust = false;
     * pdmData = false;
     * sckPol = false;
     * wsPol = false;
     * divider = 1;
     * oneChannel = false;
     * dataLength = 16;
     * frameLength = 32;
     * position = 0;
     * fifoLevel = 4;
     */
    I2S_TxGetDefaultConfig(&tx_config);
    tx_config.divider     = I2S_CLOCK_DIVIDER;
    tx_config.mode        = kI2S_ModeDspWsShort;
    tx_config.wsPol       = true;
    tx_config.dataLength  = 32U;
    tx_config.frameLength = 32 * 8U;

    I2S_TxInit(DEMO_I2S_TX, &tx_config);
    I2S_EnableSecondaryChannel(DEMO_I2S_TX, kI2S_SecondaryChannel1, false, 64);
    I2S_EnableSecondaryChannel(DEMO_I2S_TX, kI2S_SecondaryChannel2, false, 128);
    I2S_EnableSecondaryChannel(DEMO_I2S_TX, kI2S_SecondaryChannel3, false, 192);

    I2S_TxTransferCreateHandleDMA(DEMO_I2S_TX, &s_i2sTxHandle, &s_i2sTxDmaHandle, i2s_Callback, NULL);
}

static void DEMO_AbortRecordPlayback(void)
{
    /* Abort DMIC */
    DMIC_TransferAbortReceiveDMA(DMIC0, &s_dmicDmaHandle[0]);
    DMIC_TransferAbortReceiveDMA(DMIC0, &s_dmicDmaHandle[1]);
    DMIC_TransferAbortReceiveDMA(DMIC0, &s_dmicDmaHandle[2]);
    DMIC_TransferAbortReceiveDMA(DMIC0, &s_dmicDmaHandle[3]);
    DMIC_TransferAbortReceiveDMA(DMIC0, &s_dmicDmaHandle[4]);
    DMIC_TransferAbortReceiveDMA(DMIC0, &s_dmicDmaHandle[5]);
    DMIC_TransferAbortReceiveDMA(DMIC0, &s_dmicDmaHandle[6]);
    DMIC_TransferAbortReceiveDMA(DMIC0, &s_dmicDmaHandle[7]);

    /* Abort I2S */
    I2S_TransferAbortDMA(DEMO_I2S_TX, &s_i2sTxHandle);

    /* Abort M2M channel */
    DMA_AbortTransfer(&s_memcpyDmaHandle0);
    DMA_AbortTransfer(&s_memcpyDmaHandle1);
}

static void DEMO_DMAChannelConfigurations(void)
{
    uint32_t i = 0;

    /* DMA configurations */
    DMA_Init(DEMO_DMA);

    for (i = 0; i < DEMO_DMIC_NUMS; i++)
    {
        DMA_EnableChannel(DEMO_DMA, i + DEMO_DMIC_DMA_RX_CHANNEL_0);
        /* configurations for DMIC channel */
        DMA_SetChannelPriority(DEMO_DMA, DEMO_DMIC_DMA_RX_CHANNEL_0 + i, kDMA_ChannelPriority1);
        DMA_CreateHandle(&s_dmaHandle[i], DEMO_DMA, DEMO_DMIC_DMA_RX_CHANNEL_0 + i);
    }

