Masmiseim36/nxpSDK/boards/mimxrt685audevk/demo_apps/dmic_i2s_hwvad/dmic_i2s_hwvad.c
    /* configurations for I2S channel */
    DMA_EnableChannel(DEMO_DMA, DEMO_I2S_TX_CHANNEL);
    DMA_SetChannelPriority(DEMO_DMA, DEMO_I2S_TX_CHANNEL, kDMA_ChannelPriority3);
    DMA_CreateHandle(&s_i2sTxDmaHandle, DEMO_DMA, DEMO_I2S_TX_CHANNEL);

    /* configurations for memcpy channel channel */
    DMA_EnableChannel(DEMO_DMA, DEMO_DMA_MEMCPY_CHANNEL_0);
    DMA_SetChannelPriority(DEMO_DMA, DEMO_DMA_MEMCPY_CHANNEL_0, kDMA_ChannelPriority0);
    DMA_CreateHandle(&s_memcpyDmaHandle0, DEMO_DMA, DEMO_DMA_MEMCPY_CHANNEL_0);
    DMA_SetCallback(&s_memcpyDmaHandle0, NULL, NULL);

    DMA_EnableChannel(DEMO_DMA, DEMO_DMA_MEMCPY_CHANNEL_1);
    DMA_SetChannelPriority(DEMO_DMA, DEMO_DMA_MEMCPY_CHANNEL_1, kDMA_ChannelPriority0);
    DMA_CreateHandle(&s_memcpyDmaHandle1, DEMO_DMA, DEMO_DMA_MEMCPY_CHANNEL_1);
    DMA_SetCallback(&s_memcpyDmaHandle1, memcpy_channel_callback, NULL);
    DMA_SetChannelConfig(DMA0, DEMO_DMA_MEMCPY_CHANNEL_1, &s_channelTrigger, false);

    /* connect two memory to memoery channels, channel0 trigger channel 1 after one descriptor exhaust */
    INPUTMUX_Init(INPUTMUX);
    INPUTMUX_AttachSignal(INPUTMUX, DEMO_DMA_MEMCPY_CHANNEL_1, kINPUTMUX_Dma0TrigOutAToDma0);
    INPUTMUX_AttachSignal(INPUTMUX, DEMO_DMA_MEMCPY_CHANNEL_0, kINPUTMUX_Dma0OtrigChannel0ToTriginChannels);

    DMA_DisableChannelInterrupts(DEMO_DMA, DEMO_DMIC_DMA_RX_CHANNEL_0);
    DMA_DisableChannelInterrupts(DEMO_DMA, DEMO_DMIC_DMA_RX_CHANNEL_1);
    DMA_DisableChannelInterrupts(DEMO_DMA, DEMO_DMIC_DMA_RX_CHANNEL_2);
    DMA_DisableChannelInterrupts(DEMO_DMA, DEMO_DMIC_DMA_RX_CHANNEL_3);
    DMA_DisableChannelInterrupts(DEMO_DMA, DEMO_DMIC_DMA_RX_CHANNEL_4);
    DMA_DisableChannelInterrupts(DEMO_DMA, DEMO_DMIC_DMA_RX_CHANNEL_5);
    DMA_DisableChannelInterrupts(DEMO_DMA, DEMO_DMIC_DMA_RX_CHANNEL_6);
    DMA_DisableChannelInterrupts(DEMO_DMA, DEMO_DMIC_DMA_RX_CHANNEL_7);

    /* Only enable the maximum dmic channel's dma interrupt */
#if DEMO_DMIC_MAX_ID == 0
    DMA_EnableChannelInterrupts(DEMO_DMA, DEMO_DMIC_DMA_RX_CHANNEL_0);
#endif
#if DEMO_DMIC_MAX_ID == 1
    DMA_EnableChannelInterrupts(DEMO_DMA, DEMO_DMIC_DMA_RX_CHANNEL_1);
#endif
#if DEMO_DMIC_MAX_ID == 2
    DMA_EnableChannelInterrupts(DEMO_DMA, DEMO_DMIC_DMA_RX_CHANNEL_2);
#endif
#if DEMO_DMIC_MAX_ID == 3
    DMA_EnableChannelInterrupts(DEMO_DMA, DEMO_DMIC_DMA_RX_CHANNEL_3);
#endif
#if DEMO_DMIC_MAX_ID == 4
    DMA_EnableChannelInterrupts(DEMO_DMA, DEMO_DMIC_DMA_RX_CHANNEL_4);
#endif
#if DEMO_DMIC_MAX_ID == 5
    DMA_EnableChannelInterrupts(DEMO_DMA, DEMO_DMIC_DMA_RX_CHANNEL_5);
#endif
#if DEMO_DMIC_MAX_ID == 6
    DMA_EnableChannelInterrupts(DEMO_DMA, DEMO_DMIC_DMA_RX_CHANNEL_6);
#endif
#if DEMO_DMIC_MAX_ID == 7
    DMA_EnableChannelInterrupts(DEMO_DMA, DEMO_DMIC_DMA_RX_CHANNEL_7);
#endif
}

static void DEMO_DMAMemcpyChannelConfigurations(void)
{
    DMA_SetupDescriptor(&(s_memcpyDescriptor[0]),
                        DMA_CHANNEL_XFER(true, true, false, true, 2U, kDMA_AddressInterleave1xWidth,
                                         kDMA_AddressInterleave4xWidth, RECORD_BUFFER_SIZE * sizeof(uint32_t)),
                        s_recordBuffer0, &s_processedAudio[2], &(s_memcpyDescriptor[1]));

    DMA_SetupDescriptor(&(s_memcpyDescriptor[1]),
                        DMA_CHANNEL_XFER(true, true, false, true, 2U, kDMA_AddressInterleave1xWidth,
                                         kDMA_AddressInterleave4xWidth, RECORD_BUFFER_SIZE * sizeof(uint32_t)),
                        &s_recordBuffer0[RECORD_BUFFER_SIZE * sizeof(uint32_t)],
                        &s_processedAudio[RECORD_BUFFER_SIZE * sizeof(uint32_t) * 4U + 2], &(s_memcpyDescriptor[0]));

    /* must make sure the memcpy buffer index is not confilct with the DMIC filling buffer index */
    if (s_dmicBufferIndex == 1U)
    {
        DMA_SubmitChannelDescriptor(&s_memcpyDmaHandle0, &(s_memcpyDescriptor[0]));
    }
    else
    {
        DMA_SubmitChannelDescriptor(&s_memcpyDmaHandle0, &(s_memcpyDescriptor[1]));
    }

    DMA_SetupDescriptor(&(s_memcpyDescriptor[2]),
                        DMA_CHANNEL_XFER(true, true, false, true, 2U, kDMA_AddressInterleave1xWidth,
                                         kDMA_AddressInterleave4xWidth, RECORD_BUFFER_SIZE * sizeof(uint32_t)),
                        s_recordBuffer1, &s_processedAudio[6], &(s_memcpyDescriptor[3]));

    DMA_SetupDescriptor(&(s_memcpyDescriptor[3]),
                        DMA_CHANNEL_XFER(true, true, false, true, 2U, kDMA_AddressInterleave1xWidth,
                                         kDMA_AddressInterleave4xWidth, RECORD_BUFFER_SIZE * sizeof(uint32_t)),
                        &s_recordBuffer1[RECORD_BUFFER_SIZE * sizeof(uint32_t)],
                        &s_processedAudio[RECORD_BUFFER_SIZE * sizeof(uint32_t) * 4U + 6], &(s_memcpyDescriptor[2]));

    /* must make sure the memcpy buffer index is not confilct with the DMIC filling buffer index */
    if (s_dmicBufferIndex == 1U)
    {
        DMA_SubmitChannelDescriptor(&s_memcpyDmaHandle1, &(s_memcpyDescriptor[2]));
    }
    else
    {
        DMA_SubmitChannelDescriptor(&s_memcpyDmaHandle1, &(s_memcpyDescriptor[3]));
    }

    DMA_StartTransfer(&s_memcpyDmaHandle0);
}

static void DEMO_DMICChannelConfigurations(void)
{
    uint32_t i = 0;

    /* dmic channel configurations */
    DMIC_Init(DMIC0);
    DMIC_Use2fs(DMIC0, true);
    bool rightChannel = false;

    for (i = 0U; i < DEMO_DMIC_NUMS; i++)
    {
        if (i % 2)
        {
            rightChannel = true;
        }
        else
        {
            rightChannel = false;
        }

        DMIC_ConfigChannel(DMIC0, (dmic_channel_t)i, (stereo_side_t)rightChannel, &s_dmicChannelConfig);
        DMIC_FifoChannel(DMIC0, i, FIFO_DEPTH, true, true);

        DMIC_TransferCreateHandleDMA(DMIC0, &s_dmicDmaHandle[i], dmic_Callback, NULL, &s_dmaHandle[i]);
        DMIC_InstallDMADescriptorMemory(&s_dmicDmaHandle[i], &s_dmaDescriptorPingpong[i * PLAYBACK_BUFFER_NUM],
                                        PLAYBACK_BUFFER_NUM);
    }

    /*Gain of the noise estimator */
    DMIC_SetGainNoiseEstHwvad(DMIC0, 0x02U);

