Masmiseim36/nxpSDK/boards/mimxrt685audevk/demo_apps/dmic_i2s_hwvad/dmic_i2s_hwvad.c
    /*Gain of the signal estimator */
    DMIC_SetGainSignalEstHwvad(DMIC0, 0x01U);

    /* 00 = first filter by-pass, 01 = hpf_shifter=1, 10 = hpf_shifter=4 */
    DMIC_SetFilterCtrlHwvad(DMIC0, 0x01U);

    /*input right-shift of (GAIN x 2 -10) bits (from -10bits (0000) to +14bits (1100)) */
    DMIC_SetInputGainHwvad(DMIC0, 0x04U);

    DisableDeepSleepIRQ(HWVAD0_IRQn);
    DisableIRQ(HWVAD0_IRQn);

#ifdef DMIC_FLASH_TARGET
    DMA_EnableChannelPeriphRq(DEMO_DMA, DEMO_DMIC_DMA_RX_CHANNEL_0);
    DMA_EnableChannelPeriphRq(DEMO_DMA, DEMO_DMIC_DMA_RX_CHANNEL_1);
    DMA_EnableChannelPeriphRq(DEMO_DMA, DEMO_DMIC_DMA_RX_CHANNEL_2);
    DMA_EnableChannelPeriphRq(DEMO_DMA, DEMO_DMIC_DMA_RX_CHANNEL_3);
    DMA_EnableChannelPeriphRq(DEMO_DMA, DEMO_DMIC_DMA_RX_CHANNEL_4);
    DMA_EnableChannelPeriphRq(DEMO_DMA, DEMO_DMIC_DMA_RX_CHANNEL_5);
    DMA_EnableChannelPeriphRq(DEMO_DMA, DEMO_DMIC_DMA_RX_CHANNEL_6);
    DMA_EnableChannelPeriphRq(DEMO_DMA, DEMO_DMIC_DMA_RX_CHANNEL_7);

    DMIC_EnableChannelDma(DMIC0, DEMO_DMIC_CHANNEL_0, true);
    DMIC_EnableChannelDma(DMIC0, DEMO_DMIC_CHANNEL_1, true);
    DMIC_EnableChannelDma(DMIC0, DEMO_DMIC_CHANNEL_2, true);
    DMIC_EnableChannelDma(DMIC0, DEMO_DMIC_CHANNEL_3, true);
    DMIC_EnableChannelDma(DMIC0, DEMO_DMIC_CHANNEL_4, true);
    DMIC_EnableChannelDma(DMIC0, DEMO_DMIC_CHANNEL_5, true);
    DMIC_EnableChannelDma(DMIC0, DEMO_DMIC_CHANNEL_6, true);
    DMIC_EnableChannelDma(DMIC0, DEMO_DMIC_CHANNEL_7, true);
#else
    DMIC_EnableChannnel(DMIC0, DMIC_CHANEN_EN_CH0(1));
    DMIC_EnableChannnel(DMIC0, DMIC_CHANEN_EN_CH1(1));
    DMIC_EnableChannnel(DMIC0, DMIC_CHANEN_EN_CH2(1));
    DMIC_EnableChannnel(DMIC0, DMIC_CHANEN_EN_CH3(1));

    DMIC_EnableChannnel(DMIC0, DMIC_CHANEN_EN_CH4(1));
    DMIC_EnableChannnel(DMIC0, DMIC_CHANEN_EN_CH5(1));
    DMIC_EnableChannnel(DMIC0, DMIC_CHANEN_EN_CH6(1));
    DMIC_EnableChannnel(DMIC0, DMIC_CHANEN_EN_CH7(1));
#endif

    DMIC_FilterResetHwvad(DMIC0, true);
    DMIC_FilterResetHwvad(DMIC0, false);
    /* reset hwvad internal interrupt */
    DMIC_CtrlClrIntrHwvad(DMIC0, true);
    /* Delay to clear first spurious interrupt and let the filter converge */
    SDK_DelayAtLeastUs(20000, SystemCoreClock);
    /*HWVAD Normal operation */
    DMIC_CtrlClrIntrHwvad(DMIC0, false);
    DMIC_HwvadEnableIntCallback(DMIC0, DMIC0_HWVAD_Callback);
    EnableDeepSleepIRQ(HWVAD0_IRQn);
    DisableIRQ(HWVAD0_IRQn);
}

static void memcpy_channel_callback(struct _dma_handle *handle, void *userData, bool transferDone, uint32_t intmode)
{
    if (s_RecordEmptyBlock)
    {
        s_RecordEmptyBlock--;
    }
    s_m2mBufferIndex = s_m2mBufferIndex == 0U ? 1U : 0U;
    s_m2mBufferReady = true;
}

static void dmic_Callback(DMIC_Type *base, dmic_dma_handle_t *handle, status_t status, void *userData)
{
    if (kStatus_DMIC_Idle == status)
    {
        s_dmicBufferIndex  = s_dmicBufferIndex == 0U ? 1U : 0U;
        s_isDMICTriggerred = true;
    }
}

static void i2s_Callback(I2S_Type *base, i2s_dma_handle_t *handle, status_t completionStatus, void *userData)
{
    if (s_RecordEmptyBlock < PLAYBACK_BUFFER_NUM)
    {
        s_RecordEmptyBlock++;
    }
}

#ifdef DMIC_FLASH_TARGET
static void ReceiverTransferConfig(dmic_transfer_t *startAddress,
                                   void *dataAddr,
                                   uint32_t xferNum,
                                   uint32_t dataWidth,
                                   uint32_t dataSizePerTransfer,
                                   uint32_t interleaveSize,
                                   uint32_t startChannel)
{
    uint32_t i = 0, offset = 0U;

    for (i = 0; i < xferNum; i += 2)
    {
        DMA_SetupDescriptor(&(s_dmaDescriptorPingpong[i + startChannel * 2U]),
                            DMA_CHANNEL_XFER(true, false, false, true, 2U, kDMA_AddressInterleave0xWidth,
                                             interleaveSize, dataSizePerTransfer),
                            (uint32_t *)DMIC_FifoGetAddress(DMIC0, i / 2U + startChannel),
                            (uint8_t *)((uint32_t)dataAddr + offset),
                            &(s_dmaDescriptorPingpong[i + 1 + startChannel * 2U]));

        DMA_SetupDescriptor(&(s_dmaDescriptorPingpong[i + 1 + startChannel * 2U]),
                            DMA_CHANNEL_XFER(true, false, false, true, 2U, kDMA_AddressInterleave0xWidth,
                                             interleaveSize, dataSizePerTransfer),
                            (uint32_t *)DMIC_FifoGetAddress(DMIC0, i / 2U + startChannel),
                            (uint8_t *)((uint32_t)dataAddr + dataSizePerTransfer * interleaveSize + offset),
                            &(s_dmaDescriptorPingpong[i + startChannel * 2U]));

        offset += dataWidth;
        /* must make sure the memcpy buffer index is not confilct with the DMIC filling buffer index */
        DMA_SubmitChannelDescriptor(&s_dmaHandle[i / 2U + startChannel],
                                    &(s_dmaDescriptorPingpong[i + startChannel * 2U]));
        DMA_StartTransfer(&s_dmaHandle[i / 2U + startChannel]);
    }
}
#else
static void ReceiverTransferConfig(dmic_transfer_t *startAddress,
                                   void *dataAddr,
                                   uint32_t xferNum,
                                   uint32_t dataWidth,
                                   uint32_t dataSizePerTransfer,
                                   uint32_t interleaveSize)
{
    uint32_t i = 0, offset = 0U;

    for (i = 0; i < xferNum; i += 2)
    {
        startAddress[i].data                   = (uint8_t *)((uint32_t)dataAddr + offset);
        startAddress[i].dataWidth              = dataWidth;
        startAddress[i].dataSize               = dataSizePerTransfer;
        startAddress[i].dataAddrInterleaveSize = interleaveSize;
        startAddress[i].linkTransfer           = &startAddress[i + 1];

        startAddress[i + 1].data      = (uint8_t *)((uint32_t)dataAddr + dataSizePerTransfer * interleaveSize + offset);
        startAddress[i + 1].dataWidth = dataWidth;
        startAddress[i + 1].dataSize  = dataSizePerTransfer;
        startAddress[i + 1].dataAddrInterleaveSize = interleaveSize;
        startAddress[i + 1].linkTransfer           = &startAddress[i];

        offset += dataWidth;
    }
}
#endif

#ifdef DMIC_FLASH_TARGET
static void DEMO_PreparingRecordDMIC(void)
{
    ReceiverTransferConfig(s_receiveXfer0, s_recordBuffer0, RECORD_BUFFER_NUM / 2, sizeof(uint16_t), RECORD_BUFFER_SIZE,
                           kDMA_AddressInterleave4xWidth, 0U);
    ReceiverTransferConfig(s_receiveXfer1, s_recordBuffer1, RECORD_BUFFER_NUM / 2, sizeof(uint16_t), RECORD_BUFFER_SIZE,
                           kDMA_AddressInterleave4xWidth, 4U);

    DMIC_EnableChannnel(DMIC0,
#if DEMO_ENABLE_DMIC_0
                        DMIC_CHANEN_EN_CH0(1) |
#endif
#if DEMO_ENABLE_DMIC_1
                            DMIC_CHANEN_EN_CH1(1) |
#endif
#if DEMO_ENABLE_DMIC_2
                            DMIC_CHANEN_EN_CH2(1) |
#endif
#if DEMO_ENABLE_DMIC_3
                            DMIC_CHANEN_EN_CH3(1) |
#endif

#if DEMO_ENABLE_DMIC_4
                            DMIC_CHANEN_EN_CH4(1) |
#endif

